app/controllers/home_controller.rb

SELECT * FROM "organizations"
---
  def index
  	@organizations = Organization.all