app/controllers/organizations_controller.rb

SELECT * FROM "organizations" WHERE (name like '%Changeman%' OR city like '%Changeman%')
---
  def find_organization
  	@organization = Organization.find(params[:id])

SELECT * FROM "tags" WHERE (name like '%C%')
---
  def find_all_tags
  	@tags = Tag.all

SELECT * FROM "organizations"
---
  def index
    @organizations = Organization.all

INSERT INTO "organizations" ("name", "responsible", "address", "city", "created_at", "country", "updated_at", "phone", "website", "needs", "email") VALUES('WWF', '', '', '', '2010-08-09 19:08:35', '', '2010-08-09 19:08:35', '', '', '', '')
---
  def create
    params[:organization][:tag_ids] ||= []
    @organization = Organization.new(params[:organization])

    respond_to do |format|
      if @organization.save

UPDATE "organizations" SET "updated_at" = '2010-08-09 19:23:01', "city" = 'Porto Alegre', "responsible" = 'Pedro', "name" = 'Cruz Vermelha', "country" = 'Brazil' WHERE "id" = 3
---
  def update
    #@organization = Organization.find(params[:id])
    params[:organization][:tag_ids] ||= []

    respond_to do |format|
      if @organization.update_attributes(params[:organization])

SELECT * FROM "organizations" WHERE ("organizations"."name" = 'egfegfe')
SELECT * FROM "organizations" INNER JOIN "organizations_tags" ON "organizations".id = "organizations_tags".organization_id WHERE ("organizations_tags".tag_id = 1 )
---
  def search
    tag_ids = params[:tag_ids]
    @organizations = Organization.find(:all, :conditions => "name like '%#{params[:q]}%' OR city like '%#{params[:q]}%'")
    @organizations &= Tag.find(tag_ids.inject([]) {|a,v| a << v.to_i}).inject([]) { |a,tag| a<< tag.organizations }[0].uniq if tag_ids && !tag_ids.empty?