app/controllers/tags_controller.rb

  def index
    @tags = Tag.all
---
SELECT * FROM "tags"

  def show
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 1)

  def edit
    @tag = Tag.find(params[:id])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 5)

  def create
    @tag = Tag.new(params[:tag])

    respond_to do |format|
      if @tag.save
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES('Comida', '2010-08-10 17:57:13', '2010-08-10 17:57:13')

  def update
    @tag = Tag.find(params[:id])

    respond_to do |format|
      if @tag.update_attributes(params[:tag])
---
SELECT * FROM "tags" WHERE ("tags"."id" = 5)
UPDATE "tags" SET "updated_at" = '2010-08-10 21:08:07', "name" = 'Água' WHERE "id" = 5